; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	infrared0 - mode
	spectrograph1 - mode
	infrared2 - mode
	thermograph4 - mode
	image3 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Star3 - direction
	GroundStation7 - direction
	Star8 - direction
	Star10 - direction
	Star11 - direction
	GroundStation12 - direction
	GroundStation13 - direction
	Star4 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	Star9 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Star17 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star9)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 Star4)
	(supports instrument1 thermograph4)
	(supports instrument1 image3)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star9)
	(calibration_target instrument1 GroundStation6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
)
(:goal (and
	(have_image Planet14 infrared0)
	(have_image Phenomenon15 thermograph4)
	(have_image Planet16 infrared2)
	(have_image Star17 thermograph4)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 4
2. (calibrate satellite0 instrument0 star9)
   added: (calibrated instrument0)
   goals met: 0 of 4
3. (turn_to satellite0 planet14 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 planet14)
   goals met: 0 of 4
4. (take_image satellite0 planet14 instrument0 infrared0)
   added: (have_image planet14 infrared0)
   goals met: 1 of 4
5. (turn_to satellite0 groundstation6 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 groundstation6)
   goals met: 1 of 4
6. (turn_to satellite0 planet16 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 planet16)
   goals met: 1 of 4
7. (take_image satellite0 planet16 instrument0 infrared2)
   added: (have_image planet16 infrared2)
   goals met: 2 of 4
8. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 2 of 4
9. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 4
10. (turn_to satellite0 phenomenon15 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 phenomenon15)
   goals met: 2 of 4
11. (turn_to satellite0 star9 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 star9)
   goals met: 2 of 4
12. (calibrate satellite0 instrument1 star9)
   added: (calibrated instrument1)
   goals met: 2 of 4
13. (turn_to satellite0 phenomenon15 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 phenomenon15)
   goals met: 2 of 4
14. (take_image satellite0 phenomenon15 instrument1 thermograph4)
   added: (have_image phenomenon15 thermograph4)
   goals met: 3 of 4
15. (turn_to satellite0 star17 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 star17)
   goals met: 3 of 4
16. (take_image satellite0 star17 instrument1 thermograph4)
   added: (have_image star17 thermograph4)
   goals met: 4 of 4
